edgeimpulse/firmware-nordic-nrf52840dk-nrf5340dk/edge-impulse/ingestion-sdk-platform/NordicSemi-nrf52/sensors/lsm303agr_reg.h
#define LSM303AGR_REFERENCE_A               0x26U
#define LSM303AGR_STATUS_REG_A              0x27U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xda                    : 1;
  uint8_t yda                    : 1;
  uint8_t zda                    : 1;
  uint8_t zyxda                  : 1;
  uint8_t _xor                   : 1;
  uint8_t yor                    : 1;
  uint8_t zor                    : 1;
  uint8_t zyxor                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t zyxor                  : 1;
  uint8_t zor                    : 1;
  uint8_t yor                    : 1;
  uint8_t _xor                   : 1;
  uint8_t zyxda                  : 1;
  uint8_t zda                    : 1;
  uint8_t yda                    : 1;
  uint8_t xda                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_status_reg_a_t;

#define LSM303AGR_OUT_X_L_A                 0x28U
#define LSM303AGR_OUT_X_H_A                 0x29U
#define LSM303AGR_OUT_Y_L_A                 0x2AU
#define LSM303AGR_OUT_Y_H_A                 0x2BU
#define LSM303AGR_OUT_Z_L_A                 0x2CU
#define LSM303AGR_OUT_Z_H_A                 0x2DU
#define LSM303AGR_FIFO_CTRL_REG_A           0x2EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fth                    : 5;
  uint8_t tr                     : 1;
  uint8_t fm                     : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fm                     : 2;
  uint8_t tr                     : 1;
  uint8_t fth                    : 5;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_fifo_ctrl_reg_a_t;

#define LSM303AGR_FIFO_SRC_REG_A            0x2FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fss                    : 5;
  uint8_t empty                  : 1;
  uint8_t ovrn_fifo              : 1;
  uint8_t wtm                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wtm                    : 1;
  uint8_t ovrn_fifo              : 1;
  uint8_t empty                  : 1;
  uint8_t fss                    : 5;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_fifo_src_reg_a_t;

#define LSM303AGR_INT1_CFG_A                0x30U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlie                   : 1; /* or XDOWNE */
  uint8_t xhie                   : 1; /* or XUPE */
  uint8_t ylie                   : 1; /* or YDOWNE */
  uint8_t yhie                   : 1; /* or YUPE */
  uint8_t zlie                   : 1; /* or ZDOWNE */
  uint8_t zhie                   : 1; /* or ZUPE */
  uint8_t _6d                    : 1;
  uint8_t aoi                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t aoi                    : 1;
  uint8_t _6d                    : 1;
  uint8_t zhie                   : 1; /* or ZUPE */
  uint8_t zlie                   : 1; /* or ZDOWNE */
  uint8_t yhie                   : 1; /* or YUPE */
  uint8_t ylie                   : 1; /* or YDOWNE */
  uint8_t xhie                   : 1; /* or XUPE */
  uint8_t xlie                   : 1; /* or XDOWNE */
#endif /* DRV_BYTE_ORDER */
} lsm303agr_int1_cfg_a_t;

#define LSM303AGR_INT1_SRC_A                0x31U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl                     : 1;
  uint8_t xh                     : 1;
  uint8_t yl                     : 1;
  uint8_t yh                     : 1;
  uint8_t zl                     : 1;
  uint8_t zh                     : 1;
  uint8_t ia                     : 1;
  uint8_t not_used_01            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t ia                     : 1;
  uint8_t zh                     : 1;
  uint8_t zl                     : 1;
  uint8_t yh                     : 1;
  uint8_t yl                     : 1;
  uint8_t xh                     : 1;
  uint8_t xl                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_int1_src_a_t;

#define LSM303AGR_INT1_THS_A                0x32U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ths                    : 7;
  uint8_t not_used_01            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t ths                    : 7;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_int1_ths_a_t;

#define LSM303AGR_INT1_DURATION_A           0x33U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t d                      : 7;
  uint8_t not_used_01            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t d                      : 7;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_int1_duration_a_t;

#define LSM303AGR_INT2_CFG_A                0x34U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlie                   : 1;
  uint8_t xhie                   : 1;
  uint8_t ylie                   : 1;
  uint8_t yhie                   : 1;
  uint8_t zlie                   : 1;
  uint8_t zhie                   : 1;
  uint8_t _6d                    : 1;
  uint8_t aoi                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t aoi                    : 1;
  uint8_t _6d                    : 1;
  uint8_t zhie                   : 1;
  uint8_t zlie                   : 1;
  uint8_t yhie                   : 1;
  uint8_t ylie                   : 1;
  uint8_t xhie                   : 1;
  uint8_t xlie                   : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_int2_cfg_a_t;

#define LSM303AGR_INT2_SRC_A                0x35U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl                     : 1;
  uint8_t xh                     : 1;
  uint8_t yl                     : 1;
  uint8_t yh                     : 1;
  uint8_t zl                     : 1;
  uint8_t zh                     : 1;
  uint8_t ia                     : 1;
  uint8_t not_used_01            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t ia                     : 1;
  uint8_t zh                     : 1;
  uint8_t zl                     : 1;
  uint8_t yh                     : 1;
  uint8_t yl                     : 1;
  uint8_t xh                     : 1;
  uint8_t xl                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_int2_src_a_t;

